package exercise.If_Switch;

//Створіть змінну А значення 4.
//
//Створіть перевірку if else, яка виведено на екран слово "Спрацювало" у разі якщо змінна А буде меншою за 8
// і не дорівнює 5, але при цьому не менше або дорівнює 2.
//
//Допишіть в умову АБО перевірку: якщо число А дорівнюватиме -1, то умова також виконуватиметься.

public class Ex_5 {
    public static void main(String[] args){

        int a = -1;

        if (a < 8 && a != 5 && a >= 2 || a == -1){
            System.out.println("It worked");
        }
    }
}
